Documents/УЧ_ЗакрытиеПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УЧ_ЗакрытиеПериода</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Списание25903</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья91</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьРасходыБудующихПериодов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаблокироватьИзмененияДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПрямыеЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьКосвенныеЗатраты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределенияЗатрат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сабВариантыРаспределенияЗатратЗакрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Учетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>12</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРеализовано</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПроизводство</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Издержки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПроц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>27</v8:Digits>
									<v8:FractionDigits>12</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение25</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПрибыли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Учредитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Учредители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccountingRegister>
		<Properties>
			<Name>Учетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Учетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Предприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПлана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКРХ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Крахмал</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Учетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиДок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/УЧ_ЗакрытиеПериода/Ext/ManagerModule.bsl
Функция СчетаЗакрытия() Экспорт
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Учетный.Счет9002());
	МассивСчетов.Добавить(ПланыСчетов.Учетный.Счет9003());
	МассивСчетов.Добавить(ПланыСчетов.Учетный.Счет91());
	Возврат МассивСчетов;
КонецФункции // ()

Процедура ЗаполнитьПродукцию(ИмяКоманды, Предприятие, Дата, ТЧДока, ЗаголовокСубконто3) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетныйОбороты.Субконто1 КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК Субконто2,
		|	УчетныйОбороты.КоличествоОборотДт КАК КоличествоРеализовано,
		|	УчетныйОбороты.ПодразделениеКор КАК ВидДеятельности,
		|	ВЫБОР
		|		КОГДА УчетныйОбороты1.КоличествоОборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ УчетныйОбороты.КоличествоОборот / УчетныйОбороты1.КоличествоОборот
		|	КОНЕЦ * 100 КАК Процент,
		|	УчетныйОбороты.Субконто3 КАК Субконто3,
		|	УчетныйОбороты.КоличествоОборот КАК Количество,
		|	0 КАК Сумма,
		|	УчетныйОбороты.КорСубконто1 КАК НоменклатурнаяГруппа,
		|	ИСТИНА КАК ЭтоПроизводство,
		|	""Количество"" КАК ПризнакРасчета
		|ПОМЕСТИТЬ Продукция
		|ИЗ
		|	РегистрБухгалтерии.Учетный.Обороты(
		|			&НачПериода,
		|			&КонПериода,
		|			,
		|			Счет = &Счет43,
		|			,
		|			Предприятия = &ВыбПредприятие
		|				И СценарийПлана = &СценарийФакт,
		|			КорСчет = &Счет40,
		|			) КАК УчетныйОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Обороты(
		|				&НачПериода,
		|				&КонПериода,
		|				,
		|				Счет = &Счет43,
		|				,
		|				Предприятия = &ВыбПредприятие
		|					И СценарийПлана = &СценарийФакт,
		|				КорСчет = &Счет40,
		|				) КАК УчетныйОбороты1
		|		ПО УчетныйОбороты.Предприятия = УчетныйОбороты1.Предприятия
		|			И (ВЫБОР
		|				КОГДА УчетныйОбороты.КорСчет.Код = ""40""
		|					ТОГДА УчетныйОбороты.КорСубконто1 = УчетныйОбороты1.КорСубконто1
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УчетныйОбороты.Субконто1,
		|	УчетныйОбороты.Субконто2,
		|	УчетныйОбороты.КоличествоОборотДт,
		|	УчетныйОбороты.ПодразделениеКор,
		|	ВЫБОР
		|		КОГДА &РасчетСумма
		|			ТОГДА ВЫБОР
		|					КОГДА УчетныйОбороты1.СуммаОборотДт = 0
		|						ТОГДА 0
		|					ИНАЧЕ УчетныйОбороты.СуммаОборотДт / УчетныйОбороты1.СуммаОборотДт
		|				КОНЕЦ * 100
		|		ИНАЧЕ ВЫБОР
		|				КОГДА УчетныйОбороты1.КоличествоОборот = 0
		|					ТОГДА 0
		|				ИНАЧЕ УчетныйОбороты.КоличествоОборот / УчетныйОбороты1.КоличествоОборот
		|			КОНЕЦ * 100
		|	КОНЕЦ,
		|	УчетныйОбороты.Субконто3,
		|	УчетныйОбороты.КоличествоОборот,
		|	0,
		|	УчетныйОбороты.КорСубконто1,
		|	ИСТИНА,
		|	""Количество""
		|ИЗ
		|	РегистрБухгалтерии.Учетный.Обороты(
		|			&НачПериода,
		|			&КонПериода,
		|			,
		|			Счет = &Счет43,
		|			,
		|			Предприятия = &ВыбПредприятие
		|				И СценарийПлана = &СценарийФакт
		|				И ВЫБОР
		|					КОГДА ТИПЗНАЧЕНИЯ(КорСубконто1) = ТИП(Справочник.Номенклатура)
		|						ТОГДА КорСубконто1 = Субконто1
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ,
		|			КорСчет.Код = ""20"",
		|			) КАК УчетныйОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Обороты(
		|				&НачПериода,
		|				&КонПериода,
		|				,
		|				Счет = &Счет43,
		|				,
		|				Предприятия = &ВыбПредприятие
		|					И СценарийПлана = &СценарийФакт
		|					И ВЫБОР
		|						КОГДА ТИПЗНАЧЕНИЯ(КорСубконто1) = ТИП(Справочник.Номенклатура)
		|							ТОГДА КорСубконто1 = Субконто1
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ,
		|				КорСчет.Код = ""20"",
		|				) КАК УчетныйОбороты1
		|		ПО УчетныйОбороты.Предприятия = УчетныйОбороты1.Предприятия
		|ГДЕ
		|	УчетныйОбороты.КоличествоОборотДт > 0
		|	И УчетныйОбороты1.КоличествоОборотДт > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетныйОбороты.Субконто1 КАК Субконто1,
		|	УчетныйОбороты.СуммаОборот КАК КоличествоРеализовано,
		|	УчетныйОбороты.Подразделение КАК ВидДеятельности,
		|	ВЫБОР
		|		КОГДА УчетныйОбороты1.СуммаОборот = 0
		|			ТОГДА 0
		|		ИНАЧЕ УчетныйОбороты.СуммаОборот / УчетныйОбороты1.СуммаОборот
		|	КОНЕЦ * 100 КАК Процент,
		|	УчетныйОбороты.Субконто3 КАК Субконто3,
		|	&Счет9002 КАК СчетЗатрат,
		|	0 КАК Количество,
		|	УчетныйОбороты.СуммаОборот КАК Сумма,
		|	NULL КАК НоменклатурнаяГруппа,
		|	ЛОЖЬ КАК ЭтоПроизводство,
		|	УчетныйОбороты.Субконто2 КАК Субконто2,
		|	""Сумма"" КАК ПризнакРасчета
		|ИЗ
		|	РегистрБухгалтерии.Учетный.Обороты(
		|			&НачПериода,
		|			&КонПериода,
		|			,
		|			Счет = &СчетРасчета,
		|			,
		|			Предприятия = &ВыбПредприятие
		|				И НЕ Субконто1 В
		|						(ВЫБРАТЬ
		|							Продукция.Номенклатура КАК Номенклатура
		|						ИЗ
		|							Продукция КАК Продукция)
		|				И СценарийПлана = &СценарийФакт
		|				И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Номенклатура)
		|				И НЕ Субконто1 = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		|			,
		|			) КАК УчетныйОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Учетный.Обороты(
		|				&НачПериода,
		|				&КонПериода,
		|				,
		|				Счет = &СчетРасчета,
		|				,
		|				Предприятия = &ВыбПредприятие
		|					И НЕ Субконто1 В
		|							(ВЫБРАТЬ
		|								Продукция.Номенклатура КАК Номенклатура
		|							ИЗ
		|								Продукция КАК Продукция)
		|					И СценарийПлана = &СценарийФакт
		|					И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Номенклатура)
		|					И НЕ Субконто1 = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
		|				,
		|				) КАК УчетныйОбороты1
		|		ПО УчетныйОбороты.Предприятия = УчетныйОбороты1.Предприятия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Продукция.Номенклатура,
		|	Продукция.КоличествоРеализовано,
		|	Продукция.ВидДеятельности,
		|	Продукция.Процент,
		|	Продукция.Субконто3,
		|	&Счет9002,
		|	Продукция.Количество,
		|	Продукция.Сумма,
		|	Продукция.НоменклатурнаяГруппа,
		|	Продукция.ЭтоПроизводство,
		|	Продукция.Субконто2,
		|	Продукция.ПризнакРасчета
		|ИЗ
		|	Продукция КАК Продукция";

	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(Дата)-1);
	Запрос.УстановитьПараметр("ВыбПредприятие", Предприятие);
	Запрос.УстановитьПараметр("Счет9002", ПланыСчетов.Учетный.Счет9002());
	Запрос.УстановитьПараметр("Счет43", ПланыСчетов.Учетный.Счет43());
	Запрос.УстановитьПараметр("Счет40", ПланыСчетов.Учетный.Счет40());
	Запрос.УстановитьПараметр("СценарийФакт", Справочники.СценарииПланирования.СценарийФакт());
	Запрос.УстановитьПараметр("СчетРасчета", ?(ИмяКоманды = "ЗаполнитьПродукциюВыручка", ПланыСчетов.Учетный.НайтиПоКоду("90.01"), ПланыСчетов.Учетный.НайтиПоКоду("20")));
	Запрос.УстановитьПараметр("РасчетСумма", ИмяКоманды = "ЗаполнитьПродукциюСумма");

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	ТЧДока.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Субконто1) Тогда
			Продолжить;		
		КонецЕсли;
		НоваяСтрока = ТЧДока.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Субконто3) Тогда
			ЗаголовокСубконто3 = ВыборкаДетальныеЗаписи.Субконто3.Метаданные().Синоним;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ТЧДока.Количество() Тогда
		НоваяСтрока = ТЧДока.Добавить();
		НоваяСтрока.СчетЗатрат = ПланыСчетов.Учетный.Счет9002();
		НоваяСтрока.Субконто1 = Справочники.Номенклатура.НайтиПоНаименованию("Простой", Истина);
		НоваяСтрока.Процент = 100;
	КонецЕсли;
	
КонецПроцедуры
